Repository: mozilla-l10n/mt-training-data
Catalog: azz/azz_pontoon.tmx
Source language: en_us
Languages: azz

source: Download { -brand-name-firefox } for your smartphone and tablet.
azz: Xikontemoui { -brand-name-firefox } tein tionuelis tikonkuis ika mosmartphone uan motableta.

source: Download { -brand-name-mozilla } { -brand-name-firefox }, a free web browser. { -brand-name-firefox } is created by a global not-for-profit dedicated to putting individuals in control online. Get { -brand-name-firefox } for { -brand-name-windows }, { -brand-name-mac }, { -brand-name-linux }, { -brand-name-android } and { -brand-name-ios } today!
azz: Xikontemoui { -brand-name-mozilla } { -brand-name-firefox }, se navegador web tein amo se moneki kiixtauas. { -brand-name-firefox } kichijchiujkej se nechikol semanauak taltikpak tein amo kitemouaj motomintiskej ta kinpaleuiskej taltikpakneminij maj kiixyekantinemij keniuj kitatekiujtiaj Internet. ¡Xikonpia axkan Firerfox tein tionuelis tikonkuis ika { -brand-name-windows }, { -brand-name-mac }, { -brand-name-linux }, { -brand-name-android } uan { -brand-name-ios }!

source: Download Now
azz: Yekitsin xikontemoui

source: Download on the { -brand-name-app-store }
azz: Xikontemoui itech { -brand-name-app-store }

source: Earn your second security black belt with { -brand-name-firefox }’s vast array of password manager <a href="{ $addons }">add-ons</a>. Choose an existing favorite or find a next-level one through expert community ratings and reviews.
azz: Xikontani okse motiltiktajkoilpiloni tein mouika iuan yekyetolis itechkopa miakej <a href="{ $addons }"> tamajsikayomej </a> kampa se uelis kiyekanas ichtakatajkuilolmej. Xikonixpejpena se tein xikonteluelita oso xikonajsi se yankuik itechkopa ratings uan tein kinemiliaj tokniuan.

source: Enter your email
azz: Xikonijkuilo mocorreo itech tepos

source: Enter your email or 10-digit phone number
azz: Xikonijkuilo mocorreo itech tepos oso majtakti tapoualmej tein kipia moteléfono

source: Every computer program you run takes up some memory. When too much is used, your system can slooooowww down. { -brand-name-firefox } aims for a balance — using enough memory to let you browse smoothly and leaving plenty of memory to keep your computer responsive.
azz: Sejsemej programas tein moajsi itech computadora keman tekiti kikui tepitsin taelnamikilis. Komo tel miak kikuij, mosistema uelis tiuiiiiiixtiiiias. { -brand-name-firefox } tekiti keniuj moneki — kikui taelnamikilis tein ajsi uan ijkon tionuelis tikontatekiujtis Internet amo ika kuejmolmej, uan tikonkauas tel miak taelnamikilis tein ika motepos uelis tekitis.

source: Experience cutting-edge browser features in pre-release versions: { -brand-name-firefox-developer-edition }, { -brand-name-firefox-beta } and { -brand-name-firefox-nightly }. Download now!
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia navegador tein ika versiones acho release: { -brand-name-firefox-developer-edition }, { -brand-name-firefox-beta } uan { -brand-name-firefox-nightly }. ¡Axkan xikontemoui!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-android }: { -brand-name-firefox-beta } and { -brand-name-firefox-nightly }. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika { -brand-name-android }: Firefox tein Beta uan { -brand-name-firefox-nightly }. ¡Axkan xikontalili motepos!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-android }: { -brand-name-firefox-beta }, { -brand-name-firefox-aurora } and { -brand-name-firefox-nightly }. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika { -brand-name-android }: { -brand-name-firefox-beta }, { -brand-name-firefox-aurora } uan { -brand-name-firefox-nightly }. ¡Axkan xikontalili motepos!

source: Experience cutting-edge features in a pre-release browser for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program. Install now!
azz: Xikonixejeko yankuikej nepaleuilmej tein kipia se navegador achto ke nochin uelis kitatekiujtis, ika { -brand-name-ios } itechkopa programa { -brand-name-test-flight } tein kichiuak { -brand-name-apple }. ¡Axkan xikontalili motepos!

source: Explore the web faster with <a href="{ $url }">{ -brand-name-firefox } Private Browsing</a>. Only { -brand-name-firefox }’s private mode includes tracking protection which blocks ads with trackers from loading on pages. Decluttering sites means web pages can load faster.
azz: Okachi ijsiujka xikonita Web ika nepaleuil <a href="{ $url }">Maj se kitatekiujti Internet uan amo se mokuejmolo</a> tein kipia { -brand-name-firefox }. Sayoj nejin inepaleuil { -brand-name-firefox } amo kikaua maj tetoktilikan uan kiajchiua tanauatilmej tein tetoktiliaj tein moajsij itech sitios web. Se kiyektejtekpanas sitios kiijtosneki páginas web tein okachi ijsiujka monextijkej.

source: Forget the reset. { -brand-name-firefox } Password Manager keeps all your passwords so you can log in automatically, or find saved passwords easily. For super security, give your computer a <a href="{ $url }">master password</a>.
azz: Xikonelkaua oksepa tiontapeualtis. Inepaleuil { -brand-name-firefox } Password Manager kiyekpia nochin moichatakatajkuiloluan uan ijkon tionuelis ijsiujka tionkalakteuas oso amo ouij tikonajsis ichtakatajkuilolmej tein achto tikoneuak. Xikonmaka mocomputadora se <a href="{ $url }">ichtakatajkuilol tein kampa yeski kualtia</a> uan tikonpias se uejueyi yekyetolis.

source: Free Download
azz: Xikontemoui uan amo moneki tikonixtauas

source: Get answers to your questions about { -brand-name-firefox } and all { -brand-name-mozilla } products from our support team.
azz: Tonechikol akin tepaleuiaj mitsonnankiliskej tajtanilmej tein tikonpias ika { -brand-name-firefox } uan ika nochi takilmej tein pouij { -brand-name-mozilla }.

source: Get a sneak peek at our next generation web browser, and help us make it the best browser it can be: try { -brand-name-firefox-nightly }.
azz: Xikonita tonavegador web tein yankuik, uan xitechonpaleui maj tikchijchiuakan okachi kuali navegador tein moajsis: xikonixejeko { -brand-name-firefox-nightly }.

source: Get { -brand-name-firefox } for { -brand-name-android }
azz: Xikonajsi se { -brand-name-firefox } tein tionuelis tikontatekiujtis ika { -brand-name-android }

source: Get { -brand-name-firefox } for { -brand-name-ios }
azz: Xikonajsi se { -brand-name-firefox } tein tionuelis tikontatekiujtis ika { -brand-name-ios }

source: Get { -brand-name-firefox } news
azz: Maj se kiselis tanauatilmej tein mouikaj { -brand-name-firefox }

source: Get { -brand-name-firefox } tips, tricks, news and more
azz: Xikonajsi tayojmajxitilis, taixpetanilis, tanauatilmej uan okachiok tein mouika iuan { -brand-name-firefox }

source: Get { -brand-name-mozilla } updates
azz: Maj se kiselis tayankuililismej tein { -brand-name-mozilla }

source: Get it free from the { -brand-name-app-store }
azz: Xikonajsi uan amo moneki tikonixtauas itech { -brand-name-app-store }

source: Get it free on { -brand-name-google-play }
azz: Xikonajsi uan amo moneki tikonixtauas itech { -brand-name-google-play }

source: Get it on { -brand-name-google-play }
azz: Xikonajsi uan amo moneki tikonixtauas itech { -brand-name-google-play }

source: Give up the memory game with { -brand-name-firefox } Password Manager.
azz: Amo xikonteltekitilti motaelnamikilis ika inepaleuil { -brand-name-firefox } Password Manager.

source: If you haven’t previously confirmed a subscription to a { -brand-name-mozilla }-related newsletter, you may have to do so. Please check your inbox or your spam filter for an email from us.
azz: Komo achto amo tikonyekmatiltij tionmoijkuiloj uan ijkon tikonselis se amaix tein mouika iuan { -brand-name-mozilla }, xa monekis kichiuas. Ika kualtakayot, xikonyekita kampa kalakij correos oso tatsetseloloni spam tein tikontalij xa moajsis se correo tein timitsontitanilijkej.

source: If your web browser uses too much memory, switch to { -brand-name-firefox }.
azz: Komo monavegador kikui tel miak taelnamikilis, xikonpata uan xikontatekiujti { -brand-name-firefox }.

source: I’m okay with { -brand-name-mozilla } handling my info as explained in <a href="{ $url }">this Privacy Notice</a>
azz: Kuali nikita maj { -brand-name-mozilla } kitatekiujti tein nikmatiltis ijkon kemej motanauatia itech <a href="{ $url }">nejin Tanemililis keniuj tikyekpiaj tein tikseliaj</a>

source: Is your computer slow? Your browser might be using too much memory. Switch to { -brand-name-firefox } today for more speed.
azz: ¿Motepos amo ijsiujkatekiti? Xa monavegador kikuitinemi tel miak taelnamikilis. Xionmopata axkan uan xikontatekiujti { -brand-name-firefox } tein okachi ijsiuik.

source: Keep up with<br> all things { -brand-name-firefox }.
azz: Xikonsentoka ika<br> nochi taman tein kipia { -brand-name-firefox }.

source: Learn about the benefits of working at { -brand-name-mozilla } and view open positions around the world.
azz: Xikonixmati toni tatiochualis tikonpias komo tiontekitilis { -brand-name-mozilla }, uan xikonita tein tekimej axkan onkakej nochi semanauak taltikpak.

source: Less memory usage than { -brand-name-chrome }
azz: Amo okachi kikui taelnamikilis uan amo { -brand-name-chrome }

source: Multi-tasking with multiple tabs just got easier. { -brand-name-firefox } is now a multi-process browser, which means that your tabs stay fresh and won’t take forever to reload. With 86% less hang time, switch quickly between tabs even as you open more.
azz: Se kichiuas miak tekimej tein kiiliaj multitarea ika tataman pestañas axkan okachi amo ouij. { -brand-name-firefox } axkan se navegador tein uelis kipias tataman ojtokaltilismej, tein kiijtosneki ke ipestañajuan nochipa moyankuilijtiyaskej uan oksepa moijsiujkaixnextiskej. Kemej horas tein se mochixtok yejua 86% amo okachi ke inintechkopa oksekin, ika { -brand-name-firefox } xionmopata se pestaña uan okse, uan no ijkuan okachiok tikontapouas.

source: No more “try again” while you’re trying to get somewhere. Log in to your { -brand-name-firefox-account } on your phone, and your passwords come with you. Your login details will simply appear, just like that.
azz: Amo sepa ok "oksepa xikonchikua" ijkuak tikontemojtok tikonajsis se sitio. Xionkalakteua itech mocuenta Firerfox ika moteléfono uan moichtakatajkuiloluan yaskej mouan. Tein moneki tionkalakteua ipa monextis, kemej nejin.

source: No one likes a computer hog! { -brand-name-firefox } is a lean, mean (actually we’re pretty nice) browsing machine. Since we use less RAM than { -brand-name-chrome }, your other programs can keep running at top speed.
azz: ¡Se tepos tein tel amo kuali amo akin kiuelita! { -brand-name-firefox } se navegador tein ejkaujtik, tein tajtakoyampa (tein melauj, yejua semi kuali). Kemej kikui amo okachi taelnamikilis RAM tein kikuitinemi { -brand-name-chrome }, oksekin programas uelis telijsiujkatekitiskej.

source: Not only do trackers collect info, they can weigh down your browsing speeds. Only { -brand-name-firefox } Private Browsing blocks ads with hidden trackers, so you can drop the baggage and browse freely.
azz: Amo sayoj tein tetoktiliaj kinechikouaj tein teaxka, ta uelis kiijtakoskej ijsiujkayot ijkuak tekititok Internet. Sayoj { -brand-name-firefox } Private Browsing san kiajchiuilia tanauatilmej tein kipia tein teichtakatoktiliaj, uan ijkon tionuelis tikonkauas nejin tamamal uan titatojtomal tikontatekiujtis Internet.

source: Please enter an email address.
azz: Ika kualtakayot xikonijkuilo se correo itech tepos.

source: Please follow <a href="{ $url }">these instructions</a> to install { -brand-name-firefox }.
azz: Xikonchiua <a href="{ $url }">nejin tanauatilmej</a> uan ijkon tikontalilis Fiefox motepos.

source: Practice your exactitude with every bookmark manager <a href="{ $url }">add-on</a> you can think of, from full page snapshots to quick-switch sidebars to locked-down-tight private bookmarks.
azz: Xikonita sayoj tein tikonyolnejnektinemi san ika sejsemej <a href="{ $url }">tamajsikayomej</a> kampa se uelis kiyekanas neskayomej marcadores, tel miak onkakej kanachi tionuelis tikonixnemilis: kampa tikonitas páginas tein ajsitokej, barras tein tanakastan oso neskayomej marcadores tein amo senteixtenoj uan kiajchiuilijkej.

source: Send
azz: Maj motitani

source: Send { -brand-name-firefox } to your smartphone or tablet
azz: Xikonpanoltili { -brand-name-firefox } mosmartphone oso motableta

source: Send to another device
azz: Xikonpanoltili okse tepos

source: Sharing is caring, but that should be your call. { -brand-name-firefox } Private Browsing automatically erases your online info like passwords, cookies and history from your computer. So that when you close out, you leave no trace.
azz: Ijkuak se kinpanoltilis oksekin tensa monekiskia se motachilis, sayoj ke nejin moneki yeski motaixpejpenalis. { -brand-name-firefox } Private Browsing ipa kichipaua motajkuilolixneskayouan tein moajsij itech Internet, kemej ichtakatajkuilolmej, cookies uan historial itech motepos. Ijkuin, ijkuak titatsakuas, amo mokauas motaksalis tein oksekin uelis kitojtiliskej.

source: Sign in to your account and we’ll sync the bookmarks, passwords and other great things you’ve saved to { -brand-name-firefox } on other devices.
azz: Xionkalakteua itech mocuenta uan tikchiuaskej maj mosenixpatatiyajkan neskayomej marcadores, ichtaktajkuilolmej uan oksekin taman tein semi kualtsin tein tikoneuani itech oksekin teposmej.

source: SMS service available to U.S. phone numbers only. SMS &amp; data rates may apply.
azz: Nepaleuil SMS sayoj se uelis kitatekijtis ompa Estados Unidos san. Xa monekis se kiixtauas SMS oso uelis motatekiujtis datos.

source: Some websites and ads attach hidden trackers that collect your browsing info long after you’ve left. Only { -brand-name-firefox } Private Browsing has tracking protection to block them automatically.
azz: Sekin sitios web uan tanauatilmej kitaliaj tein teichtakatoktiliaj uan ijkon kinechikouaj tein moaxka itech Intenet satepan tionkisas. Sayoj { -brand-name-firefox } Private Browsing san yualitonal kiyekpixtinemi maj amo akin kiita toni se kiitstinemi Internetkopa uan ipa kiajchiuilis.

source: Sorry. This number isn’t valid. Please enter a U.S. phone number.
azz: Timoyolkokouaj. Nejin tapoual amo kualtia. Ika kualtakayot, xikonijkuilo se tapoual teléfono tein poui Estados Unidos.

source: <span>{ -brand-name-firefox-aurora }</span> for { -brand-name-android }
azz: <span>Firefox tein Aurora</span> ika { -brand-name-android }

source: <span>{ -brand-name-firefox-beta }</span> for { -brand-name-android }
azz: <span>Firefox tein Beta</span> ika { -brand-name-android }

source: <span>{ -brand-name-firefox-nightly }</span> for { -brand-name-android }
azz: <span>{ -brand-name-firefox-nightly }</span> ika { -brand-name-android }

source: <span>{ -brand-name-firefox }</span> for { -brand-name-android }
azz: <span>{ -brand-name-firefox }</span> ika { -brand-name-android }

source: <span>{ -brand-name-firefox }</span> for { -brand-name-ios }
azz: <span>{ -brand-name-firefox }</span> ika { -brand-name-ios }

source: <span>{ -brand-name-firefox }</span> + You
azz: <span>{ -brand-name-firefox }</span> + Tejuatsin

source: Supported Devices
azz: Teposmej dispositivos tein tionuelis tikontatekiujtis

source: Systems &amp; Languages
azz: Sistemas uan tepostajtolismej

source: Take your favorites on the fly. Use { -brand-name-firefox-sync } to access your bookmarks across all your devices, from desktop to mobile. Or try <a href="{ $url }">{ -brand-name-pocket }</a> to save any online article, or page and come back to later – even without internet.
azz: Xikonkui tein tikonteluelita ijkuak tikonnekis. Xikontatekiujti { -brand-name-firefox-sync } uan xionkalakis kampa moneskayouan marcadores itech nochin moteposuan, kemej tein tajkuilouapal oso tein se uelis mouikas. Oso xikontatekiujti <a href="{ $url }">{ -brand-name-pocket }</a> uan ijkon tikoneuas tein yeski tamachtilis tein moajsi itech Internet, oso página web uan satepan tionuelis tionmokepas, maski amo ika Internet.

source: Test beta versions of { -brand-name-firefox } for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program.
azz: Xikonixejeko versiones { -brand-name-firefox } tein beta ika { -brand-name-ios } itechkopa programa { -brand-name-test-flight } tein kichiuak { -brand-name-apple }.

source: Test beta versions of { -brand-name-firefox } for { -brand-name-ios } via { -brand-name-apple }’s { -brand-name-test-flight } program and help make our mobile browser for { -brand-name-iphone }, { -brand-name-ipad } and iPod touch even better.
azz: Xikonixejeko versiones { -brand-name-firefox } tein beta ika { -brand-name-ios } itechkopa programa { -brand-name-test-flight } tein kichiuak { -brand-name-apple } uan xitechonpaleui tiyektaliskej tonavegador tein se uelis kiuika kampa yeski ika { -brand-name-iphone }, { -brand-name-ipad } uan iPod touch.

source: The intended recipient of the email must have consented.
azz: Akin tikontajkuilouilis ika tepos monekik kiselij.

source: The intended recipient of the email or SMS must have consented.
azz: Akin tikontajkuilouilis ika tepos oso SMS monekik kiselij.

source: Try New Browser Features in Pre-Release Versions | { -brand-name-firefox }
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia navegador tein ika versiones acho release | { -brand-name-firefox }

source: Try New Features in a Pre-Release { -brand-name-android } Browser | { -brand-name-firefox }
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia se navegador { -brand-name-android } achto ke nochin uelis kitatekiujtis | { -brand-name-firefox }

source: Try New Features in a Pre-Release { -brand-name-ios } Browser | { -brand-name-firefox }
azz: Xikontatekiujti yankuikej nepaleuilmej tein kipia se navegador { -brand-name-ios } achto ke nochin uelis kitatekiujtis | { -brand-name-firefox }

source: Try the latest { -brand-name-android } features, before they get released to the rest of the world.
azz: Xikonixejeko inepaleuiluan { -brand-name-android } tein okachi yankuikej, achto taltikpakneminij uelis kichiuaskej.

source: Update your { -brand-name-firefox }
azz: Xikonyankuili mo{ -brand-name-firefox }

source: Welcome to { -brand-name-firefox }
azz: Kuali ke tikontapoj { -brand-name-firefox }

source: We led the tech to run 3D games at near-native speeds, and now { -brand-name-firefox } is bringing better performance to online gaming. Our powerful browser reduces lags, speeds up ping times and optimizes overall gameplay through faster, leaner browsing.
azz: Tikchiuaj teposmej maj kitekitiltiaj auilmej 3D ika ijsiujkayomej kemej yeskia yekinika, uan axkan { -brand-name-firefox } kichiua maj kuali tekitikan auilmej Internetkopa. Tonavegador tein semi kichauak amo okachi uejkaua, kiijsiuiltia tein uejkaua ping uan nochin auilmej kichiua maj kuali tekitij ijkuak se kitatekiujtia Internet okachi ijsiujka uan ejkaujtik.

source: We’re obsessed with protecting your privacy. That’s why we’ve made { -brand-name-firefox } Private Browsing more powerful than the others.
azz: Nochipa tiknemilijtinemij keniuj kuali timitsonyekpialiskej tein titechonseliltis. Yejua ika tikchijchiujkej { -brand-name-firefox } Private Browsing okachi chikauak uan amo oksekin.

source: We will only send you { -brand-name-mozilla }-related information.
azz: Sayoj timitsontitaniliskej tanauatil tein mouika iuan { -brand-name-mozilla }.

source: What’s New
azz: Tein yankuik

source: Working to keep the internet healthy, open and accessible to all, we teach web literacy, provide tools and advocate on behalf of every individual who values the internet as a global public resource.
azz: Titekitij maj Internet pakkayoyeto, tatapotok uan nochin tokniuan uelis kitatekiujtiskej, tiktenextiaj webtaixmatilis, tikmakaj manamikmej uan tikintajtolpaleuiaj sejsemej tokniuan akin kipatiuitaj maj Internet yeski kemej tein uelis kikuiskej semanauak taltikpak.

source: Your download link was sent.
azz: Tein mitsonuika kampa tiontatemouis mitsonpanoltilijkejya.

source: Your system doesn't meet the <a href="{ $url }">requirements</a> to run { -brand-name-firefox }.
azz: Mosistema amo kipia <a href="{ $url }">tein moneki</a> uan ijkon { -brand-name-firefox } amo uelis tekitis.

source: Your system may not meet the requirements for { -brand-name-firefox }, but you can try one of these versions:
azz: Xa mosistema amo kipia tein moneki uan ijkon { -brand-name-firefox } tekitis, sayoj ke tionuelis tikontatekiujtis semej nejin versiones:

source: Cancel
azz: Maj motsakuili uan amo tami tein kichiujtok

source: Continue with this browser
azz: Maj niksentoka niktatekiujti nejin navegador

source: Copied!
azz: ¡Moixkopinak!

source: Copy link
azz: Xikixkopina tein se kipatskilis

source: Copy the link to open in another browser
azz: Xikixkopina tein se kipatskilis uan ijkon se uelis kitatapos itech okse navegador

source: Copy the link to share your file:
azz: Xikixkopina tein se kipatskilis uan xikinpanoltili oksekin moarchivo:

source: Create a { -firefox } Account or sign in
azz: Ximochiuili se cuenta itech { -firefox } oso xikalakteua

source: { $days }d { $hours }h { $minutes }m
azz: { $days }t { $hours }h { $minutes }m

source: Decrypting…
azz: Kichiujtok se uelis kiixtajtoltis ya…

source: Delete
azz: Maj majchiua

source: Download complete
azz: Nochi motemouij ya

source: Download files
azz: Xiktemoui tajkuilolmej archivos

source: Download { -firefox }
azz: Xiktemoui { -firefox }

source: Downloading
azz: Kitemouijtok

source: Download “{ $name }” with { -send-brand }: simple, safe file sharing
azz: Xiktemoui “{ $name }” ika { -send-brand }: amo ouij uelis tikinpanoltilis oksekin motajkuiloluan archivos uan tikyekmatis ke amo tej kipanos

source: Drag and drop files
azz: Xikintilana uan xikinkajkaua tajkuilolmej archivos

source: Encrypting…
azz: Motatijtok…

source: Expires after { $downloadCount } or { $timespan }
azz: Poliui ijkuak tiajsis { $downloadCount } oso { $timespan }

source: Feedback
azz: Nikan uelis tikijkuilos tein tiknemilijtos

source: Firefox Send requires JavaScript
azz: Firefox Send kineki maj moajsi JavaScript

source: Importing…
azz: Mokalakijtok…

source: Incorrect password. Try again.
azz: Amo yektik ichtakatajtol. Oksepa xikijkuilo.

source: Keep links active for up to { $count } days
azz: Kampa se kipatskilis maj kisentokakan kualtiakan se tonal ok / { $count } tonalmej ok

source: Learn about other { -mozilla } services
azz: Okachi tikmatis okseki tapaleuilmej tein kitemaka { -mozilla }

source: Learn more.
azz: Xiktemoui tajkuilolmej archivos.

source: Link expired
azz: Nejin tein tikpatskilij amo tekititok ya

source: Manage shared files from any device
azz: Itech tein yeski tepos xikixyekana motajkuiloluan archivos tein tikinpanoltilij oksekin

source: Maximum password length: { $length }
azz: Keniuj ueyak ichtakatajtol, maj amo pano: { $length }

source: { $num } days
azz: 1 tonal / { $num } tonalmej

source: { $num } downloads
azz: 1 kitemouijtok / { $num } kintemouijtok

source: { $num } files
azz: 1 archivo / { $num } archivos

source: { $num } hours
azz: 1 hora / { $num } hora

source: { $num } minutes
azz: 1 minuto / { $num } minuto

source: { $num } weeks
azz: 1 semana / { $num } semana

source: OK
azz: Kuali yetok

source: Only { $count } archives are allowed.
azz: Sayoj { $count } tajkuilolmej archivos uelis moajsiskej saj.

source: Only { $count } files can be uploaded at a time.
azz: Sayoj { $count } tajkuilolmej archivos uelis tikolochtejkoltis saj.

source: or click to send up to { $size }
azz: oso xikpatskili uan tiktitanis, sayoj tein amo panoua { $size }

source: ({ $partialSize } of { $totalSize })
azz: ({ $partialSize } itech { $totalSize })

source: Password
azz: Ichtakatajtol
